NACA0012/NACA00122D_4deg_v230/constant/parcelInjectionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      parcelInjectionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// (x y z) (u v w) d rho mDot T Cp (Y0..Y2) (Yg0..YgN) (Yl0..YlN) (Ys0..YsN)
(
    (-0.76 -0.0076 -0.130) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.128) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.126) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.124) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.122) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.120) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.118) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.116) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.114) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.112) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.110) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.108) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.106) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.104) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.102) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.100) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.098) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.096) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.094) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.092) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.090) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.088) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.086) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.084) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.082) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.080) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.078) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.076) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.074) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.072) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.070) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.068) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.066) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.064) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.062) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.060) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.058) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.056) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.054) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.052) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.050) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.048) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.046) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.044) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.042) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.040) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.038) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.036) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.034) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.032) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.030) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.028) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.026) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.024) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.022) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.020) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.018) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.016) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.014) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.012) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.010) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.008) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.006) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.004) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 -0.002) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076     0) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.100) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.098) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.096) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.094) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.092) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.090) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.088) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.086) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.084) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.082) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.080) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.078) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.076) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.074) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.072) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.070) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.068) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.066) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.064) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.062) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.060) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.058) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.056) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.054) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.052) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.050) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.048) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.046) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.044) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.042) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.040) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.038) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.036) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.034) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.032) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.030) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.028) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.026) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.024) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.022) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.020) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.018) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.016) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.014) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.012) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.010) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.008) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.006) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.004) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
    (-0.76 -0.0076 0.002) (67.04 0 0) 20e-6 1000 0.002 247  4200 (0 1 0) () (1) ()
);


// ************************************************************************* //
