NACA0012/NACA00122D_4deg_v230/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omegaInlet      10;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    front
    {
        type            empty;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 10;
        value           uniform 10;
    }
    back
    {
        type            empty;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 10;
        value           uniform 10;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            omegaWallFunction;
        value           uniform 10;
    }

}

// ************************************************************************* //
